### References
[tabula-py: Extract table from PDF into Python DataFrame](https://blog.chezo.uno/tabula-py-extract-table-from-pdf-into-python-dataframe-6c7acfa5f302)

[Parse Data from PDFs with Tabula and Pandas](https://hackersandslackers.com/data-from-pdfs-tabula-pandas/)

Install tabula pkg

$ pip install tabula-py

In [1]:
import tabula as t

In [2]:
# list available functions provided by this package
dir(t)

['DistributionNotFound',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 'convert_into',
 'convert_into_by_batch',
 'environment_info',
 'errors',
 'file_util',
 'get_distribution',
 'read_pdf',
 'read_pdf_with_template',
 'template',
 'util',
 'wrapper']

list PDF files in the current folder

In [17]:
!ls *.pdf

data_tables.pdf

In [8]:
pdf_path="data_tables.pdf"

read the 1st table into a dataframe by default

In [18]:
df = t.read_pdf(pdf_path)

In [19]:
type(df), df.shape, df.columns

(pandas.core.frame.DataFrame,
 (4, 2),
 Index(['Number of Coils', 'Number of Paperclips'], dtype='object'))

In [11]:
df

   Number of Coils Number of Paperclips
0                5              3, 5, 4
1               10              7, 8, 6
2               15           11, 10, 12
3               20           15, 13, 14

check documentation on `read_pdf` function for detailed usage

In [12]:
t.read_pdf?

t.read_pdf(
    input_path,
    output_format='dataframe',
    encoding='utf-8',
    java_options=None,
    pandas_options=None,
    multiple_tables=False,
    user_agent=None,
    **kwargs,
)

We collect all the tables into a list of pandas dataframe

In [20]:
dfs = t.read_pdf(pdf_path, pages="all", multiple_tables=True)

In [21]:
type(dfs), len(dfs)

(list, 3)

In [15]:
dfs

[                 0                     1
 0  Number of Coils  Number of Paperclips
 1                5               3, 5, 4
 2               10               7, 8, 6
 3               15            11, 10, 12
 4               20            15, 13, 14,
               0                1                           2          3  \
 0   Speed (mph)           Driver                         Car     Engine
 1       407.447  Craig Breedlove           Spirit of America     GE J47
 2       413.199        Tom Green            Wingfoot Express     WE J46
 3        434.22       Art Arfons               Green Monster     GE J79
 4       468.719  Craig Breedlove           Spirit of America     GE J79
 5       526.277  Craig Breedlove           Spirit of America     GE J79
 6       536.712       Art Arfons               Green Monster     GE J79
 7       555.127  Craig Breedlove  Spirit of America, Sonic 1     GE J79
 8       576.553       Art Arfons               Green Monster     GE J79
 9       600.601  Craig Breedlove  Spirit of America, Sonic 1     GE J79
 10      622.407    Gary Gabelich                  Blue Flame     Rocket
 11      633.468    Richard Noble                    Thrust 2  RR RG 146
 12      763.035       Andy Green                  Thrust SSC    RR Spey

            4
 0       Date
 1     8/5/63
 2    10/2/64
 3    10/5/64
 4   10/13/64
 5   10/15/65
 6   10/27/65
 7    11/2/65
 8    11/7/65
 9   11/15/65
 10  10/23/70
 11   10/4/83
 12  10/15/97  ,
                        0              1
 0  Time (drops of water)  Distance (cm)
 1                      1        10,11,9
 2                      2     29, 31, 30
 3                      3     59, 58, 61
 4                      4   102, 100, 98
 5                      5  122, 125, 127]

In [22]:
df_table1 = dfs[0]
df_table1

                 0                     1
0  Number of Coils  Number of Paperclips
1                5               3, 5, 4
2               10               7, 8, 6
3               15            11, 10, 12
4               20            15, 13, 14

In [23]:
df_table2 = dfs[1]
df_table2

,0,1,2,3,4
0,Speed (mph),Driver,Car,Engine,Date
1,407.447,Craig Breedlove,Spirit of America,GE J47,8/5/63
2,413.199,Tom Green,Wingfoot Express,WE J46,10/2/64
3,434.22,Art Arfons,Green Monster,GE J79,10/5/64
4,468.719,Craig Breedlove,Spirit of America,GE J79,10/13/64
5,526.277,Craig Breedlove,Spirit of America,GE J79,10/15/65
6,536.712,Art Arfons,Green Monster,GE J79,10/27/65
7,555.127,Craig Breedlove,"Spirit of America, Sonic 1",GE J79,11/2/65
8,576.553,Art Arfons,Green Monster,GE J79,11/7/65
9,600.601,Craig Breedlove,"Spirit of America, Sonic 1",GE J79,11/15/65
10,622.407,Gary Gabelich,Blue Flame,Rocket,10/23/70
11,633.468,Richard Noble,Thrust 2,RR RG 146,10/4/83
12,763.035,Andy Green,Thrust SSC,RR Spey,10/15/97

In [24]:
df_table3 = dfs[2]
df_table3

                       0              1
0  Time (drops of water)  Distance (cm)
1                      1        10,11,9
2                      2     29, 31, 30
3                      3     59, 58, 61
4                      4   102, 100, 98
5                      5  122, 125, 127